{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"sequential","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer_1","optional":false},"registered_name":null,"name":"input_layer_1","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"dense","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3],"dtype":"float32","keras_history":["input_layer_1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["dense",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"registered_name":null,"build_config":{"input_shape":[null,5]},"name":"dense_2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5],"dtype":"float32","keras_history":["dense_1",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer_1",0,0]],"output_layers":[["dense_2",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{}},"image_data_format":"channels_last","input_shapes":[[3]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[3],"values":["o7ttv5ZvL78UgyQ+"]}],"outputs":[{"shape":[1],"values":["kHU5PQ=="]}]}],"trainable_params":{"dense":{"weights":["TCyVPijxMb94foo+Fg6Dvqh9GL+F4QK/AQMBP7YiSL9JCtS+U+IqP8/9U726Yga/frIFvni9rD60/Eu/yiGCPrcUnb6kWvI9ykTwvod6IL61owy/kyA7vyS+hD48YUI/ZmX5vhngCz9n4qu9Mq+UPoqU7b6kolA/"],"bias":["6sV2PoYqqj7a2ta9sfufPQaUpT7o4l49Wsk9vYIx3j3m0oo+qb2HPg=="]},"dense_1":{"weights":["b77XPgo05b5Q/So/tzu3PBY7ez3IIy4/ezDIvra4Br7k/T4+HJY1P0Vb6D7kJ82+R5eUPsmP6j68JRA+IZXLvR1nrD5T5T8/Bj8PvqX6tb6SzJo+pTM7voC1tr7pdgk/Z3UBP1jv8T6u0h29iEEMP6FuMr681Fy+ou6/vkl1pD5sq6Q+DEzgPnfHZ77lWq++TJokv/9yYz7Imh8/TRoSP8MJDz5qXDc+gjRnvxU0Hj8xYOI+MNiEvahBhz3h4jY//8u9vjL53j0="],"bias":["Qy/kvdikLr783cI+lrFovRTHk70="]},"dense_2":{"weights":["LjHyvhoYYr7XUdM+qBd7v9y13b4="],"bias":["LBF8Pg=="]}},"hash":"97f852acb85df30b29483def6621d6a317f448463b2500154e4577929dbcb6e1"}